In [227]:
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
# from pandas_datareader import data, web  # <- use this.

In [ ]:
li=pd.Series([1,2,3],index=['a','b','c'])
list(li.index)

In [ ]:
dates=pd.date_range('2014-07-01', '2014-07-06')
z=pd.Series(range(len(dates)),index=dates)
temps2 = pd.Series([70, 75, 69, 83, 79, 77],index = dates)
print(f'Z:\n{z } \n\n temp2:\n{temps2}\n \n this is divided:\n {temps2 - z}')

In [ ]:
zz=pd.Series([1,2,3],index=pd.date_range('2014-07-01', '2014-07-03'))
temps_df = pd.DataFrame({'Missoula': z,
                'Philadelphia': temps2})
# tem_df=pd.DataFrame(zz,columns=['one'],index=zz.index)

temps_df['Difference']=temps_df.Missoula - temps_df['Philadelphia']
temps_df

In [ ]:
#the same 
# temps_df.iloc[[1, 3, 5]]['Difference']
# temps_df.iloc[[1, 3, 5]].Difference 
temps_df[temps_df.Difference < -70]

In [ ]:
df = pd.read_csv('data/test1.csv', parse_dates=['date'],index_col='some')

In [ ]:
na=np.array(np.arange(2.5,10,2))

In [ ]:
na[2:], na.size # size of array
# print(len(na))
# In numpy array we have size and the len
np.arange(0, 10+1, 2)
np.arange(10,0,-1) # Counting Down
print(np.linspace(1, 10,4))
print(np.arange(0,10,2))

nz=np.array([[1,2,3],[1,4,5]])
nz

In [ ]:
nz[0,0:3] # Slicing
nz.size
# len(nz)
nz[:,2]
a = np.arange(5)
# a[a< 2]
np.sum(a < 3) # sum of the element less than 3
a1 = np.arange(1, 10)
a1[3:8] ,a1
a1[::3],a1
a1[9:0:-1],a1 #reversed

In [ ]:
a = np.arange(0, 9)
# and reshape to a 3x3 2-d array
m = a.reshape(3, 3)
m

In [ ]:
m_reval=m.ravel() # Generate the Flatt 2-D array
m_reval.size, len (m_reval)

In [ ]:

zp=np.array([[1,2,3],[4,1,4],[21,4,7],[1,5,8]])
# zp.size, 
zp, zp.transpose(), zp.T ==zp.transpose()

In [ ]:
a = np.arange(9).reshape(3, 3)
b= a*10

np.hstack((a,b)), np.concatenate((a, b), axis = 1)

In [ ]:
print('a:\n {} \n \n b:\n {} '.format( a ,b))
# np.dstack((a, b))
np.column_stack((np.ravel(a),np.ravel(b)))

In [ ]:
a = np.arange(12).reshape(4, 3)
print(a)

# np.split(a, 3, axis = 1)
np.hsplit(a, 3) ,np.vsplit(a, 4)
np.split(a, 2, axis = 0)

In [ ]:
m = np.arange(10, 19).reshape(3, 3)
print(m)
m.argmax(),m.max(), m.min(axis = 1), m.max(axis = 0) # 0 mean columns and 1 is row
m.cumsum(), m.cumprod()
m.ravel().ndim

### creting Seires and Dataframe

In [ ]:
s3=pd.Series([2])
np.random.seed(123456)
s8=pd.Series(np.random.randn(5),index=pd.date_range('2022-01-01','2022-01-5'))
s6 = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4}) # from dict
s6

In [ ]:
s7=pd.Series([[1,2,3,np.nan],[5,1,7,np.nan],np.nan])
s8, s7

In [ ]:
# s7.value_counts(), s8.value_counts()
s8.take([0, 4]),'\n', s8[[0,4]]
s8.loc['2022-01-01'], s8.iloc[4]
# s8.iloc[[1,2]]
# s8.ix['2022-01-01','2022-01-02']
# s8[0]

In [ ]:
s6 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s9=pd.Series([4, 3, 2, 1], index=['d', 'c', 'b', 'a'])
s8 = pd.Series({'b': 6, 'c': 7, 'd': 9, 'e': 10})

print(s6.values + s9.values) # Via values of each clumns
s6 +s9  # Via index (the order is not important)
s8+ s9 # via index (the missing pair of index return the NaN)

In [ ]:
nda = np.array([1, 2, 3, 4, np.NaN,30,40,100])
nda.mean(),nda.std()
s = pd.Series(nda)
s.mean()
s.mean(skipna=False)
s=s+20

In [ ]:
# print(s)
# s[(s > 20) & (s <= 50)]
s[(s <40) | (s >20)] # AND
(s >= 0).all()
(s <= 24).sum()

s1 = pd.Series(np.random.randn(3),index=['a','2','c'])
s2 = pd.Series(np.random.randn(3),index=s1.index)
combined = pd.concat([s1, s2],axis=1)
combined.columns=['a','b']
combined.index=[np.arange(len(combined))]

# combined
print(f' combined: \n {combined}')
s1,s2,

In [ ]:
s3=s2.reindex(['b','g','a'])
s3

In [ ]:
s1 = pd.Series(np.random.randn(4), [1, 'b', 'c', 'd'])
s2 = s1.reindex(['a', 'c', 'g'])
s1,s2

In [ ]:
s1 = pd.Series([0, 1, 2], index=[0, 1, 2])
s2 = pd.Series([3, 4, 5], index=['0', '1', '2'])
s2.index = s2.index.values.astype(int)
s2 + s1

In [ ]:

s4=pd.Series(np.arange(5))
s4.index=['f','b','c','e','a']
print(s4)
s4.reindex(['a', 'f','cc'],fill_value=0)

In [ ]:
s = pd.Series(np.arange(100, 110), index=np.arange(10, 20))
s

In [ ]:
s.iloc[[1,2]]
s[:5:2]
s[4: :2] # start at fourth pos stepping 2

In [ ]:
s1 = pd.Series(np.random.randn(3),index=['a','2','c'])
s2 = pd.Series(np.random.randn(3))
df=pd.DataFrame(s1,s2)
# co=pd.concat([s1, s2],axis=0) # Concat the seriess
s2,s1

### DataFrame

In [ ]:
# pd.DataFrame(np.array([[10, 11], [20, 21]]) )
df = pd.DataFrame(np.array([[10, 11], [20, 21]]),columns=['a','b'])
df_2=pd.DataFrame({
    'A1':np.array(np.linspace(12,21,50)),
    'A2': np.array(np.linspace(100,210,50))
})
s3 = pd.Series(np.arange(12, 14), index=[1, 2])
df = pd.DataFrame({'c1': s1, 'c2': s2, 'c3': s3})
df['c1']:df['c2']

In [ ]:
s1 = pd.Series(np.arange(1, 6, 1))
s2 = pd.Series(np.arange(6, 11, 1))
pd.DataFrame({'c1': s1, 'c2': s2})

df.loc[:,['c1','c2']]
df.iloc[[0,1],0] # Get 0,1 row in second column

# df.ix[:, 'c2']
df.iat[2,1],df.iloc[2,1 ],df

In [ ]:
df['c3'][df['c3']<15]
df.rename(columns={
    'c590':'c590-70'
},inplace=True)

In [ ]:
df.iloc[:,0][2:]
df_copy=df[0:3]['c2'].copy()
df_copy,df
# rcopy = sp500[0:3][['Price']].copy()

In [ ]:
s = pd.Series(
{'1': 'Is in the DataFrame',
'MSFT': 'Not in the DataFrame'} )
s

In [ ]:
# df.pop(item='c2')
#  df.drop(['c3'], axis = 1,inplace=True)
df

In [ ]:
df.append(df.iloc[0,:]).fillna('NAA')

In [ ]:
data_1=np.array([[2,4],[5,1]])

df_2=pd.DataFrame(data_1,columns=['c590-70','comment'])
aa=pd.concat([df,df_2],keys=['df', 'df_2'],axis=1)

In [ ]:
aa.iloc[0:3,[0,1]],aa
aa[3:]['df']['comment']
df_2.append(df,ignore_index=True)

In [ ]:
df = pd.DataFrame(np.random.randn(5, 4),columns=['A', 'B', 'C', 'D'])
df

In [ ]:
df=pd.read_csv('btc_1.csv',index_col=0,usecols=['Open','Date'],header=0)
df.to_csv('btc2.csv')

In [ ]:
# df_2=pd.read_table('btc2.csv',index_col=False,sep='-')
df_2=pd.read_csv('btc2.csv',skiprows=100,nrows=5,header=0,names=['Date','Open'])
df_2['Date']="do"
df_2

In [ ]:
# import pandas.io.data namespace, alias as web
from pandas_datareader import data, web  # <- use this.

# import pandas.io.data as web

# and datetime for the dates
import datetime
# start end end dates
start = datetime.datetime(2012, 1, 1)
end = datetime.datetime(2014, 1, 27)
# read the MSFT stock data from yahoo! and view the head
# yahoo = wb.DataReader('MSFT', 'yahoo', start, end)
# yahoo.head()

In [228]:
data=sns.load_dataset('iris')
data[:5]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [232]:
gr=data.groupby(['species','petal_length'])
gr.nth(4)

                         sepal_length  sepal_width  petal_width
species    petal_length
setosa     1.3                    5.0          3.5          0.3
           1.4                    4.4          2.9          0.2
           1.5                    5.7          4.4          0.4
           1.6                    4.8          3.1          0.2
versicolor 4.0                    5.8          2.6          1.2
           4.5                    6.0          2.9          1.5
           4.7                    6.7          3.1          1.5
virginica  5.1                    6.9          3.1          2.3
           5.6                    6.3          3.4          2.4

In [278]:
import numpy as np
pd.DataFrame(gr['sepal_length'].mean())

                         sepal_length
species    petal_length
setosa     1.0               4.600000
           1.1               4.300000
           1.2               5.400000
           1.3               4.842857
           1.4               4.915385
           1.5               5.146154
           1.6               4.914286
           1.7               5.400000
           1.9               4.950000
versicolor 3.0               5.100000
           3.3               4.950000
           3.5               5.350000
           3.6               5.600000
           3.7               5.500000
           3.8               5.500000
           3.9               5.533333
           4.0               5.780000
           4.1               5.700000
           4.2               5.725000
           4.3               6.300000
           4.4               6.275000
           4.5               5.900000
           4.6               6.400000
           4.7               6.440000
           4.8               6.350000
           4.9               6.600000
           5.0               6.700000
           5.1               6.000000
virginica  4.5               4.900000
           4.8               6.100000
           4.9               6.000000
           5.0               6.000000
           5.1               6.142857
           5.2               6.600000
           5.3               6.400000
           5.4               6.550000
           5.5               6.566667
           5.6               6.366667
           5.7               6.766667
           5.8               6.800000
           5.9               6.950000
           6.0               6.750000
           6.1               7.433333
           6.3               7.300000
           6.4               7.900000
           6.6               7.600000
           6.7               7.700000
           6.9               7.700000

In [312]:
go=data.groupby('species')
virgi_means=go.get_group('virginica').mean()
setosa_menas=go.get_group('setosa').mean()
versicolor_means=go.get_group('versicolor').mean()

print(setosa_menas)

sepal_length    5.006
sepal_width     3.428
petal_length    1.462
petal_width     0.246
dtype: float64

C:\Users\erfan\AppData\Local\Temp\ipykernel_7380\196358037.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  virgi_means=go.get_group('virginica').mean()
C:\Users\erfan\AppData\Local\Temp\ipykernel_7380\196358037.py:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  setosa_menas=go.get_group('setosa').mean()
C:\Users\erfan\AppData\Local\Temp\ipykernel_7380\196358037.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  versicolor_means=go.get_group('versicolor').mean()

In [ ]:
pd.DataFrame(gr['sepal_length'].mean())

In [315]:
df = pd.DataFrame({ 'Label': ['A', 'C', 'B', 'A', 'C'],
'Values': [0, 1, 2, 3, 4],
'Values2': [5, 6, 7, 8, 9],
'Noise': ['foo', 'bar', 'baz',
'foobar', 'barbaz']})
df

  Label  Values  Values2   Noise
0     A       0        5     foo
1     C       1        6     bar
2     B       2        7     baz
3     A       3        8  foobar
4     C       4        9  barbaz

In [337]:
grouped = df.groupby('Label')
grouped['Values'].mean( )
# grouped.first()

Label
A    1.5
B    2.0
C    2.5
Name: Values, dtype: float64

In [352]:
def xplus10(x):
    return x + 10

grouped.transform(lambda x: x + 10)
grouped.transform(xplus10)

C:\Users\erfan\AppData\Local\Temp\ipykernel_7380\2558380278.py:4: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the function.
  grouped.transform(lambda x: x + 10)
C:\Users\erfan\AppData\Local\Temp\ipykernel_7380\2558380278.py:5: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the function.
  grouped.transform(xplus10)

   Values  Values2
0      10       15
1      11       16
2      12       17
3      13       18
4      14       19

In [355]:
df = pd.DataFrame({ 'Label': list("ABABAB"),
'Values': [10, 20, 11, np.nan, 12, 22]},
index=['i1', 'i2', 'i3', 'i4', 'i5', 'i6'])
grouped = df.groupby('Label')
df

   Label  Values
i1     A    10.0
i2     B    20.0
i3     A    11.0
i4     B     NaN
i5     A    12.0
i6     B    22.0

In [372]:
grouped.first()
grouped.mean()
filled_NaNs = grouped.transform(lambda x: x.fillna(x.mean()))
filled_NaNs

    Values
i1    10.0
i2    20.0
i3    11.0
i4    21.0
i5    12.0
i6    22.0

In [407]:
np.random.seed(123456)
data = pd.Series(np.random.normal(0.5, 2, 365*3),
pd.date_range('2011-01-01', periods=365*3))
# rolling = pd.rolling_mean(data, 100, 100).dropna()
groupkey = lambda x: x.year
groups = data.groupby(groupkey)
groups.agg([np.mean, np.std])
# groups.first()

          mean       std
2011  0.362128  2.165945
2012  0.303284  2.019602
2013  0.689642  2.037010

In [475]:
df = pd.DataFrame({'Label': list('AABCCC'),
'Values': [1, 2, 3, 4, np.nan, 8]})
df

  Label  Values
0     A     1.0
1     A     2.0
2     B     3.0
3     C     4.0
4     C     NaN
5     C     8.0

In [483]:
f = lambda x: x.Values.count() > 1
f2=lambda x: x.Values
a=df.groupby('Label')
grouped = df.groupby('Label')
mean = grouped.mean().mean()

# f = lambda x: abs(x.Values.mean() - mean) > 2.0
# f = lambda x: abs(x.Values.mean() - mean) > 2.0
# df.groupby('Label').filter(f)

f = lambda x: x.Values.count() > 1
df=df.groupby('Label').filter(f, dropna=True)
df
# a.Values.isnull().sum() == 0
# df.groupby('Label').filter(lambda x: x<5)
# df.groupby('Label')

  Label  Values
0     A     1.0
1     A     2.0
3     C     4.0
4     C     NaN
5     C     8.0

In [509]:
from datetime import datetime
datetime(2014, 12, 15, 5, 30)
datetime.now().date(), datetime.today(),datetime.now(),datetime.now().time()
# pd.Timestamp("now"),datetime.now().time()
periods = pd.date_range('8/1/2014', periods=10)
date_series = pd.Series(np.random.randn(10), index=periods)
date_series

2014-08-01   -1.004239
2014-08-02    1.197946
2014-08-03    0.765543
2014-08-04   -0.423806
2014-08-05    1.041571
2014-08-06   -0.786641
2014-08-07   -0.393609
2014-08-08   -0.171092
2014-08-09    1.786173
2014-08-10   -0.575189
Freq: D, dtype: float64

In [557]:
a = date_series[3:7]
s2 = pd.Series([10, 100, 1000, 10000],index=a.index)
s3 = pd.Series(0, pd.date_range('2013-01-01',periods=20))
time_1=pd.date_range('2014-08-01',
                '2014-10-29 23:59',freq='T')
bymin = pd.Series(np.random.normal(0,2,len(time_1)),time_1, )
bymin

2014-08-01 00:00:00    5.123880
2014-08-01 00:01:00   -0.718680
2014-08-01 00:02:00   -0.595841
2014-08-01 00:03:00   -0.351388
2014-08-01 00:04:00    0.025279
                         ...
2014-10-29 23:55:00   -3.157372
2014-10-29 23:56:00   -0.880824
2014-10-29 23:57:00   -0.724423
2014-10-29 23:58:00    0.515127
2014-10-29 23:59:00    1.383141
Freq: T, Length: 129600, dtype: float64

In [573]:
dti = pd.date_range('2014-08-29', '2014-09-05', freq='B')
dti.values
dd=datetime.now().date()
do = pd.DateOffset(days = 1) # one day
# datetime.now().date(), datetime.today(),datetime.now(),datetime.now().time()
dd + do

first_minute=pd.date_range('2014-9,12',periods=50)

# calculate a rol1ing mean window of 5 periods
first_minute.roll
# # plot it against the raw data
# first_minute.plot()
# # add a legend
# plt.legend(labels=['Rolling Mean', 'Raw']);

AttributeError: module 'pandas' has no attribute 'rolling_mean'

In [605]:
filled_NaNs = grouped.transform(lambda x: x.fillna(x.sum()))
# filled_NaNs,grouped.tail()

f=lambda x: x.fillna(x.sum())

grouped.transform(f)

   Values
0     1.0
1     2.0
3     4.0
4    12.0
5     8.0

<bound method DataFrame.fillna of        Values
Label
A         3.0
C        12.0>

In [652]:
import numpy as np
a=np.array([1,3,4])
b=np.array([1,3,5])
a=pd.DataFrame([[(1,2,3),[1,3,4]]])

list(a.values[0])[1]
a.iloc[a.index[-1],0]

(1, 2, 3)

In [ ]:
a.iloc[a.index[-1],0][0]